benchmark/experiment-4/10ms-tmaret-002-kernel-1000-250.txt
Running 25s test @ http://tmaret-002-kernel-1000.ns-team-aemdevreplication.svc.cluster.local:8080/sync?cpuIterations=66&idleDelay=9&fileLength=1000
  250 threads and 250 connections
  Thread calibration: mean lat.: 2589.170ms, rate sampling interval: 9256ms
  Thread calibration: mean lat.: 2589.932ms, rate sampling interval: 9273ms
  Thread calibration: mean lat.: 2582.483ms, rate sampling interval: 9256ms
  Thread calibration: mean lat.: 2593.948ms, rate sampling interval: 9338ms
  Thread calibration: mean lat.: 2594.550ms, rate sampling interval: 9273ms
  Thread calibration: mean lat.: 2619.374ms, rate sampling interval: 9322ms
  Thread calibration: mean lat.: 2585.648ms, rate sampling interval: 9248ms
  Thread calibration: mean lat.: 2605.537ms, rate sampling interval: 9355ms
  Thread calibration: mean lat.: 2587.259ms, rate sampling interval: 9240ms
  Thread calibration: mean lat.: 2595.075ms, rate sampling interval: 9289ms
  Thread calibration: mean lat.: 2596.489ms, rate sampling interval: 9306ms
  Thread calibration: mean lat.: 2595.893ms, rate sampling interval: 9330ms
  Thread calibration: mean lat.: 2603.375ms, rate sampling interval: 9273ms
  Thread calibration: mean lat.: 2585.893ms, rate sampling interval: 9273ms
  Thread calibration: mean lat.: 2579.515ms, rate sampling interval: 9273ms
  Thread calibration: mean lat.: 2585.521ms, rate sampling interval: 9281ms
  Thread calibration: mean lat.: 2596.561ms, rate sampling interval: 9281ms
  Thread calibration: mean lat.: 2583.735ms, rate sampling interval: 9232ms
  Thread calibration: mean lat.: 2594.453ms, rate sampling interval: 9248ms
  Thread calibration: mean lat.: 2568.128ms, rate sampling interval: 9215ms
  Thread calibration: mean lat.: 2598.264ms, rate sampling interval: 9289ms
  Thread calibration: mean lat.: 2591.568ms, rate sampling interval: 9248ms
  Thread calibration: mean lat.: 2602.214ms, rate sampling interval: 9289ms
  Thread calibration: mean lat.: 2579.672ms, rate sampling interval: 9289ms
  Thread calibration: mean lat.: 2593.731ms, rate sampling interval: 9281ms
  Thread calibration: mean lat.: 2580.734ms, rate sampling interval: 9224ms
  Thread calibration: mean lat.: 2571.729ms, rate sampling interval: 9183ms
  Thread calibration: mean lat.: 2576.092ms, rate sampling interval: 9281ms
  Thread calibration: mean lat.: 2570.291ms, rate sampling interval: 9207ms
  Thread calibration: mean lat.: 2561.031ms, rate sampling interval: 9207ms
  Thread calibration: mean lat.: 2609.708ms, rate sampling interval: 9281ms
  Thread calibration: mean lat.: 2587.375ms, rate sampling interval: 9256ms
  Thread calibration: mean lat.: 2627.167ms, rate sampling interval: 9330ms
  Thread calibration: mean lat.: 2613.530ms, rate sampling interval: 9363ms
  Thread calibration: mean lat.: 2577.040ms, rate sampling interval: 9240ms
  Thread calibration: mean lat.: 2590.344ms, rate sampling interval: 9281ms
  Thread calibration: mean lat.: 2585.808ms, rate sampling interval: 9273ms
  Thread calibration: mean lat.: 2597.681ms, rate sampling interval: 9281ms
  Thread calibration: mean lat.: 2603.038ms, rate sampling interval: 9338ms
  Thread calibration: mean lat.: 2607.645ms, rate sampling interval: 9330ms
  Thread calibration: mean lat.: 2594.406ms, rate sampling interval: 9289ms
  Thread calibration: mean lat.: 2609.049ms, rate sampling interval: 9265ms
  Thread calibration: mean lat.: 2604.617ms, rate sampling interval: 9256ms
  Thread calibration: mean lat.: 2589.554ms, rate sampling interval: 9240ms
  Thread calibration: mean lat.: 2583.231ms, rate sampling interval: 9240ms
  Thread calibration: mean lat.: 2621.642ms, rate sampling interval: 9363ms
  Thread calibration: mean lat.: 2576.703ms, rate sampling interval: 9297ms
  Thread calibration: mean lat.: 2604.546ms, rate sampling interval: 9314ms
  Thread calibration: mean lat.: 2588.374ms, rate sampling interval: 9232ms
  Thread calibration: mean lat.: 2600.239ms, rate sampling interval: 9224ms
  Thread calibration: mean lat.: 2602.631ms, rate sampling interval: 9306ms
  Thread calibration: mean lat.: 2636.463ms, rate sampling interval: 9338ms
  Thread calibration: mean lat.: 2590.248ms, rate sampling interval: 9297ms
  Thread calibration: mean lat.: 2603.075ms, rate sampling interval: 9330ms
  Thread calibration: mean lat.: 2595.738ms, rate sampling interval: 9256ms
  Thread calibration: mean lat.: 2569.253ms, rate sampling interval: 9232ms
  Thread calibration: mean lat.: 2592.345ms, rate sampling interval: 9314ms
  Thread calibration: mean lat.: 2575.246ms, rate sampling interval: 9191ms
  Thread calibration: mean lat.: 2574.334ms, rate sampling interval: 9330ms
  Thread calibration: mean lat.: 2603.609ms, rate sampling interval: 9256ms
  Thread calibration: mean lat.: 2584.998ms, rate sampling interval: 9256ms
  Thread calibration: mean lat.: 2589.159ms, rate sampling interval: 9248ms
  Thread calibration: mean lat.: 2620.870ms, rate sampling interval: 9306ms
  Thread calibration: mean lat.: 2593.278ms, rate sampling interval: 9256ms
  Thread calibration: mean lat.: 2591.442ms, rate sampling interval: 9314ms
  Thread calibration: mean lat.: 2574.572ms, rate sampling interval: 9215ms
  Thread calibration: mean lat.: 2567.944ms, rate sampling interval: 9232ms
  Thread calibration: mean lat.: 2604.441ms, rate sampling interval: 9330ms
  Thread calibration: mean lat.: 2588.821ms, rate sampling interval: 9240ms
  Thread calibration: mean lat.: 2590.687ms, rate sampling interval: 9289ms
  Thread calibration: mean lat.: 2609.011ms, rate sampling interval: 9338ms
  Thread calibration: mean lat.: 2585.334ms, rate sampling interval: 9306ms
  Thread calibration: mean lat.: 2587.016ms, rate sampling interval: 9273ms
  Thread calibration: mean lat.: 2607.739ms, rate sampling interval: 9281ms
  Thread calibration: mean lat.: 2576.866ms, rate sampling interval: 9256ms
  Thread calibration: mean lat.: 2591.644ms, rate sampling interval: 9248ms
  Thread calibration: mean lat.: 2600.162ms, rate sampling interval: 9297ms
  Thread calibration: mean lat.: 2631.981ms, rate sampling interval: 9363ms
  Thread calibration: mean lat.: 2619.577ms, rate sampling interval: 9289ms
  Thread calibration: mean lat.: 2608.105ms, rate sampling interval: 9363ms
  Thread calibration: mean lat.: 2570.395ms, rate sampling interval: 9215ms
  Thread calibration: mean lat.: 2574.001ms, rate sampling interval: 9199ms
  Thread calibration: mean lat.: 2596.999ms, rate sampling interval: 9297ms
  Thread calibration: mean lat.: 2602.213ms, rate sampling interval: 9330ms
  Thread calibration: mean lat.: 2624.452ms, rate sampling interval: 9330ms
  Thread calibration: mean lat.: 2584.424ms, rate sampling interval: 9224ms
  Thread calibration: mean lat.: 2590.031ms, rate sampling interval: 9207ms
  Thread calibration: mean lat.: 2569.370ms, rate sampling interval: 9265ms
  Thread calibration: mean lat.: 2614.378ms, rate sampling interval: 9306ms
  Thread calibration: mean lat.: 2585.347ms, rate sampling interval: 9281ms
  Thread calibration: mean lat.: 2604.003ms, rate sampling interval: 9306ms
  Thread calibration: mean lat.: 2568.953ms, rate sampling interval: 9256ms
  Thread calibration: mean lat.: 2609.038ms, rate sampling interval: 9265ms
  Thread calibration: mean lat.: 2580.313ms, rate sampling interval: 9281ms
  Thread calibration: mean lat.: 2573.360ms, rate sampling interval: 9273ms
  Thread calibration: mean lat.: 2595.107ms, rate sampling interval: 9265ms
  Thread calibration: mean lat.: 2593.672ms, rate sampling interval: 9281ms
  Thread calibration: mean lat.: 2610.014ms, rate sampling interval: 9306ms
  Thread calibration: mean lat.: 2572.483ms, rate sampling interval: 9248ms
  Thread calibration: mean lat.: 2585.487ms, rate sampling interval: 9273ms
  Thread calibration: mean lat.: 2604.001ms, rate sampling interval: 9330ms
  Thread calibration: mean lat.: 2612.993ms, rate sampling interval: 9306ms
  Thread calibration: mean lat.: 2596.336ms, rate sampling interval: 9338ms
  Thread calibration: mean lat.: 2622.139ms, rate sampling interval: 9338ms
  Thread calibration: mean lat.: 2605.372ms, rate sampling interval: 9322ms
  Thread calibration: mean lat.: 2581.859ms, rate sampling interval: 9297ms
  Thread calibration: mean lat.: 2626.154ms, rate sampling interval: 9314ms
  Thread calibration: mean lat.: 2622.380ms, rate sampling interval: 9363ms
  Thread calibration: mean lat.: 2601.749ms, rate sampling interval: 9371ms
  Thread calibration: mean lat.: 2606.577ms, rate sampling interval: 9306ms
  Thread calibration: mean lat.: 2603.196ms, rate sampling interval: 9338ms
  Thread calibration: mean lat.: 2587.631ms, rate sampling interval: 9297ms
  Thread calibration: mean lat.: 2583.759ms, rate sampling interval: 9265ms
  Thread calibration: mean lat.: 2582.623ms, rate sampling interval: 9281ms
  Thread calibration: mean lat.: 2572.913ms, rate sampling interval: 9248ms
  Thread calibration: mean lat.: 2586.945ms, rate sampling interval: 9224ms
  Thread calibration: mean lat.: 2576.554ms, rate sampling interval: 9273ms
  Thread calibration: mean lat.: 2583.547ms, rate sampling interval: 9281ms
  Thread calibration: mean lat.: 2576.809ms, rate sampling interval: 9240ms
  Thread calibration: mean lat.: 2548.445ms, rate sampling interval: 9199ms
  Thread calibration: mean lat.: 2596.477ms, rate sampling interval: 9297ms
  Thread calibration: mean lat.: 2594.168ms, rate sampling interval: 9306ms
  Thread calibration: mean lat.: 2597.511ms, rate sampling interval: 9322ms
  Thread calibration: mean lat.: 2596.920ms, rate sampling interval: 9289ms
  Thread calibration: mean lat.: 2613.150ms, rate sampling interval: 9248ms
  Thread calibration: mean lat.: 2575.664ms, rate sampling interval: 9240ms
  Thread calibration: mean lat.: 2614.229ms, rate sampling interval: 9330ms
  Thread calibration: mean lat.: 2622.835ms, rate sampling interval: 9355ms
  Thread calibration: mean lat.: 2592.293ms, rate sampling interval: 9330ms
  Thread calibration: mean lat.: 2566.172ms, rate sampling interval: 9256ms
  Thread calibration: mean lat.: 2576.375ms, rate sampling interval: 9224ms
  Thread calibration: mean lat.: 2591.244ms, rate sampling interval: 9256ms
  Thread calibration: mean lat.: 2612.637ms, rate sampling interval: 9289ms
  Thread calibration: mean lat.: 2611.304ms, rate sampling interval: 9281ms
  Thread calibration: mean lat.: 2597.278ms, rate sampling interval: 9273ms
  Thread calibration: mean lat.: 2584.554ms, rate sampling interval: 9265ms
  Thread calibration: mean lat.: 2568.396ms, rate sampling interval: 9207ms
  Thread calibration: mean lat.: 2580.079ms, rate sampling interval: 9265ms
  Thread calibration: mean lat.: 2590.561ms, rate sampling interval: 9256ms
  Thread calibration: mean lat.: 2634.607ms, rate sampling interval: 9347ms
  Thread calibration: mean lat.: 2596.185ms, rate sampling interval: 9306ms
  Thread calibration: mean lat.: 2579.525ms, rate sampling interval: 9297ms
  Thread calibration: mean lat.: 2600.448ms, rate sampling interval: 9273ms
  Thread calibration: mean lat.: 2628.381ms, rate sampling interval: 9273ms
  Thread calibration: mean lat.: 2635.179ms, rate sampling interval: 9281ms
  Thread calibration: mean lat.: 2566.411ms, rate sampling interval: 9199ms
  Thread calibration: mean lat.: 2618.055ms, rate sampling interval: 9297ms
  Thread calibration: mean lat.: 2607.711ms, rate sampling interval: 9338ms
  Thread calibration: mean lat.: 2604.162ms, rate sampling interval: 9297ms
  Thread calibration: mean lat.: 2583.818ms, rate sampling interval: 9256ms
  Thread calibration: mean lat.: 2577.059ms, rate sampling interval: 9248ms
  Thread calibration: mean lat.: 2604.996ms, rate sampling interval: 9297ms
  Thread calibration: mean lat.: 2600.983ms, rate sampling interval: 9306ms
  Thread calibration: mean lat.: 2582.604ms, rate sampling interval: 9224ms
  Thread calibration: mean lat.: 2588.780ms, rate sampling interval: 9240ms
  Thread calibration: mean lat.: 2585.659ms, rate sampling interval: 9289ms
  Thread calibration: mean lat.: 2585.510ms, rate sampling interval: 9199ms
  Thread calibration: mean lat.: 2602.948ms, rate sampling interval: 9338ms
  Thread calibration: mean lat.: 2625.357ms, rate sampling interval: 9297ms
  Thread calibration: mean lat.: 2606.779ms, rate sampling interval: 9314ms
  Thread calibration: mean lat.: 2604.340ms, rate sampling interval: 9297ms
  Thread calibration: mean lat.: 2578.393ms, rate sampling interval: 9240ms
  Thread calibration: mean lat.: 2597.370ms, rate sampling interval: 9297ms
  Thread calibration: mean lat.: 2628.179ms, rate sampling interval: 9355ms
  Thread calibration: mean lat.: 2608.543ms, rate sampling interval: 9306ms
  Thread calibration: mean lat.: 2595.690ms, rate sampling interval: 9281ms
  Thread calibration: mean lat.: 2573.100ms, rate sampling interval: 9215ms
  Thread calibration: mean lat.: 2609.552ms, rate sampling interval: 9273ms
  Thread calibration: mean lat.: 2603.079ms, rate sampling interval: 9289ms
  Thread calibration: mean lat.: 2607.964ms, rate sampling interval: 9363ms
  Thread calibration: mean lat.: 2625.979ms, rate sampling interval: 9363ms
  Thread calibration: mean lat.: 2588.887ms, rate sampling interval: 9306ms
  Thread calibration: mean lat.: 2575.787ms, rate sampling interval: 9199ms
  Thread calibration: mean lat.: 2599.794ms, rate sampling interval: 9273ms
  Thread calibration: mean lat.: 2578.888ms, rate sampling interval: 9248ms
  Thread calibration: mean lat.: 2582.822ms, rate sampling interval: 9281ms
  Thread calibration: mean lat.: 2595.103ms, rate sampling interval: 9306ms
  Thread calibration: mean lat.: 2617.307ms, rate sampling interval: 9306ms
  Thread calibration: mean lat.: 2600.234ms, rate sampling interval: 9265ms
  Thread calibration: mean lat.: 2610.422ms, rate sampling interval: 9289ms
  Thread calibration: mean lat.: 2573.910ms, rate sampling interval: 9240ms
  Thread calibration: mean lat.: 2606.208ms, rate sampling interval: 9240ms
  Thread calibration: mean lat.: 2584.550ms, rate sampling interval: 9224ms
  Thread calibration: mean lat.: 2611.974ms, rate sampling interval: 9281ms
  Thread calibration: mean lat.: 2605.212ms, rate sampling interval: 9273ms
  Thread calibration: mean lat.: 2598.732ms, rate sampling interval: 9289ms
  Thread calibration: mean lat.: 2599.869ms, rate sampling interval: 9297ms
  Thread calibration: mean lat.: 2597.676ms, rate sampling interval: 9281ms
  Thread calibration: mean lat.: 2616.063ms, rate sampling interval: 9314ms
  Thread calibration: mean lat.: 2607.841ms, rate sampling interval: 9297ms
  Thread calibration: mean lat.: 2626.594ms, rate sampling interval: 9404ms
  Thread calibration: mean lat.: 2606.990ms, rate sampling interval: 9314ms
  Thread calibration: mean lat.: 2600.592ms, rate sampling interval: 9265ms
  Thread calibration: mean lat.: 2605.714ms, rate sampling interval: 9314ms
  Thread calibration: mean lat.: 2606.654ms, rate sampling interval: 9338ms
  Thread calibration: mean lat.: 2604.208ms, rate sampling interval: 9322ms
  Thread calibration: mean lat.: 2592.373ms, rate sampling interval: 9240ms
  Thread calibration: mean lat.: 2610.938ms, rate sampling interval: 9314ms
  Thread calibration: mean lat.: 2576.796ms, rate sampling interval: 9306ms
  Thread calibration: mean lat.: 2605.414ms, rate sampling interval: 9306ms
  Thread calibration: mean lat.: 2612.738ms, rate sampling interval: 9314ms
  Thread calibration: mean lat.: 2607.119ms, rate sampling interval: 9265ms
  Thread calibration: mean lat.: 2618.828ms, rate sampling interval: 9322ms
  Thread calibration: mean lat.: 2631.454ms, rate sampling interval: 9363ms
  Thread calibration: mean lat.: 2602.054ms, rate sampling interval: 9297ms
  Thread calibration: mean lat.: 2585.426ms, rate sampling interval: 9265ms
  Thread calibration: mean lat.: 2598.213ms, rate sampling interval: 9289ms
  Thread calibration: mean lat.: 2577.883ms, rate sampling interval: 9207ms
  Thread calibration: mean lat.: 2615.577ms, rate sampling interval: 9297ms
  Thread calibration: mean lat.: 2592.916ms, rate sampling interval: 9256ms
  Thread calibration: mean lat.: 2627.517ms, rate sampling interval: 9404ms
  Thread calibration: mean lat.: 2587.418ms, rate sampling interval: 9281ms
  Thread calibration: mean lat.: 2602.259ms, rate sampling interval: 9273ms
  Thread calibration: mean lat.: 2610.383ms, rate sampling interval: 9273ms
  Thread calibration: mean lat.: 2592.719ms, rate sampling interval: 9224ms
  Thread calibration: mean lat.: 2586.230ms, rate sampling interval: 9215ms
  Thread calibration: mean lat.: 2599.021ms, rate sampling interval: 9306ms
  Thread calibration: mean lat.: 2611.059ms, rate sampling interval: 9330ms
  Thread calibration: mean lat.: 2565.916ms, rate sampling interval: 9183ms
  Thread calibration: mean lat.: 2620.370ms, rate sampling interval: 9306ms
  Thread calibration: mean lat.: 2594.308ms, rate sampling interval: 9273ms
  Thread calibration: mean lat.: 2562.110ms, rate sampling interval: 9199ms
  Thread calibration: mean lat.: 2601.136ms, rate sampling interval: 9306ms
  Thread calibration: mean lat.: 2599.584ms, rate sampling interval: 9265ms
  Thread calibration: mean lat.: 2600.963ms, rate sampling interval: 9297ms
  Thread calibration: mean lat.: 2592.917ms, rate sampling interval: 9297ms
  Thread calibration: mean lat.: 2586.306ms, rate sampling interval: 9248ms
  Thread calibration: mean lat.: 2601.639ms, rate sampling interval: 9306ms
  Thread calibration: mean lat.: 2585.683ms, rate sampling interval: 9289ms
  Thread calibration: mean lat.: 2595.219ms, rate sampling interval: 9232ms
  Thread calibration: mean lat.: 2602.395ms, rate sampling interval: 9338ms
  Thread calibration: mean lat.: 2611.806ms, rate sampling interval: 9355ms
  Thread calibration: mean lat.: 2604.941ms, rate sampling interval: 9330ms
  Thread calibration: mean lat.: 2611.419ms, rate sampling interval: 9297ms
  Thread calibration: mean lat.: 2587.446ms, rate sampling interval: 9273ms
  Thread calibration: mean lat.: 2590.531ms, rate sampling interval: 9248ms
  Thread calibration: mean lat.: 2611.608ms, rate sampling interval: 9306ms
  Thread calibration: mean lat.: 2586.930ms, rate sampling interval: 9256ms
  Thread calibration: mean lat.: 2567.218ms, rate sampling interval: 9306ms
  Thread calibration: mean lat.: 2624.129ms, rate sampling interval: 9281ms
  Thread calibration: mean lat.: 2621.054ms, rate sampling interval: 9330ms
  Thread calibration: mean lat.: 2592.840ms, rate sampling interval: 9256ms
  Thread calibration: mean lat.: 2615.009ms, rate sampling interval: 9322ms
  Thread calibration: mean lat.: 2600.043ms, rate sampling interval: 9289ms
  Thread calibration: mean lat.: 2591.112ms, rate sampling interval: 9256ms
  Thread calibration: mean lat.: 2567.880ms, rate sampling interval: 9240ms
  Thread calibration: mean lat.: 2570.328ms, rate sampling interval: 9224ms
  Thread calibration: mean lat.: 2584.603ms, rate sampling interval: 9256ms
  Thread calibration: mean lat.: 2615.125ms, rate sampling interval: 9289ms
  Thread calibration: mean lat.: 2607.575ms, rate sampling interval: 9289ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.98s     2.20s   12.92s    57.73%
    Req/Sec    96.97      0.55    98.00    100.00%
  605917 requests in 24.85s, 719.42MB read
Requests/sec:  24383.82
Transfer/sec:     28.95MB